do 

function run(msg, matches) 
  return [[ 
  🗽ⓢⓞⓤⓡⓢ ⓚⓔⓔⓟⓔⓡ🗽
 🏌🔻ــ↜ــــ↜ــــ↜ـــــ↜ــــ🔺🏌
┣_┓ الاوامر كالتالي: ┏_┫
🛡⁽م1₎
        🚩لورئية اوامر الاداره↜🎐

🛡⁽م2₎
       🚩لورئية اوامر الحمايه↜🔏

🛡⁽م3₎
       🚩لورئية اوامر الثانويه↜🎠

🛡⁽م المطور₎
       🚩لورئية اوامر المطور↜🎭
🏌🔻ــ↜ــــ↜ــــ↜ـــــ↜ــــ🔺🏌
🗯Ꝅєєꝓєℜ🔊 @llX8Xll
🗯Ꝅєєꝓєℜ🔊 @lZlxlZlBOT
🗯๕ḩẩหหℓё🔊 @keeper_ch
]] 

end 

return { 
description = "Help list", 
usage = "Help list", 
patterns = { 
"^(الاوامر)$", 
"^(الاوامر)$",
}, 
run = run 
} 
end