-- made by { @llX8Xll } 
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "السلام عليكم"
rs[1] = "وعليـكم السلام ورحمـة الله وبركاتهُ😍"

ws[2] = "هلاو"
rs[2] = "هلوات عيونـي نورت😌🌷"

ws[3] = "هلو"
rs[3] = "هلوات عيونـي نورت😌🌷"

ws[4] = "سلام"
rs[4] = "وعليكم السلام والرحمه🏌🏿‍♀️"

ws[5] = "شلونك"
rs[5] = "تمام وانت شلونك🌝🍃"

ws[6] = "شلونج"
rs[6] = "تمام وانت/ي شلونك/ج🎈"

ws[7] = "دوم"
rs[7] = "الله يديم انفاسك/ج🎪🚶"

ws[8] = "شخباركم"
rs[8] = "منيحين ♥️"

ws[9] = "احبك"
rs[9] = "مي تو واني اموت بيك/ج♥️🌝"

ws[10] = "احبج"
rs[10] = "اشتم ريحـة🙄 زحف يمعودين😺🎈"

ws[11] = "اكلك"
rs[11] = "لتگول دا اسمعگ😹🍃"

ws[12] = "مرحبا"
rs[12] = "مراحب عمري نورت🌚🎈"

ws[13] = "مرحبه"
rs[13] = "مراحب نورت/ي😻"

ws[14] = "هههه"
rs[14] = "دووم الضحكـه 😽"

ws[15] = "ههههه"
rs[15] = "دووم الضحُــكه  يرويحتي💋🍃"

ws[16] = "هههههه"
rs[16] = "دووم 🙄"

ws[17] = "صباح الخير"
rs[17] = "صباح الخيرات يروحي☺️❗️"

ws[18] = "صباحو"
rs[18] = "صباحو النور اشرقت وانورت🌝🎈"

ws[19] = "شكو ماكو"
rs[19] = "غيرك بالكـلب ماكو يروحي🐅🚶"

ws[20] = "🌝"
rs[20] = "عود نضيــف الوصخ 😽🍃"

ws[21] = "🌚"
rs[21] = "منو اصخام الجدر 😹♥️"

ws[22] = "🙄"
rs[22] = "شلگيت فوگ وتباوع🤔لو انت احول🙄💔"

ws[23] = "🙄🙄"
rs[23] = "ها وين وصلت🌝🎈"

ws[24] = "🙄🙄🙄"
rs[24] = "شبيـك تباوع فوگ يالحول😽🙌"

ws[25] = "😁"
rs[25] = "باع السون 😒 چنهن دگم😻💔"

ws[26] = "😂"
rs[26] = "دوم الضحـكه😽🎈"

ws[27] = "😂😂"
rs[27] = "لتظحك هواي وتصـير فاول🌝🍃"

ws[28] = "😂😂😂"
rs[28] = "شبيك انت 🤔 تخبلت 😹🙌"

ws[29] = "☺️"
rs[29] = "فديت الخجول ♥️❗️"

ws[30] = "☺️☺️"
rs[30] = "فديت الخجول ♥️❗️"

ws[31] = "😊"
rs[31] = "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"

ws[32] = "😊😊"
rs[32] = "ابتسامه مال واحد شايل اهموم الدنيا كوله بگلبه 💔😿"

ws[33] = "😉"
rs[33] = "فديت 🙈"

ws[34] = "😉😉"
rs[34] = "باع الغمزه 🙀 تموت 🙈🍃"

ws[35] = "😌"
rs[35] = "فديت الريلاكس 😌🍃"

ws[36] = "😍😍"
rs[36] = "صعد الحب🙄 الله يستر😹💔"

ws[37] = "😘"
rs[37] = "موواح احبك😌🎈"

ws[38] = "😘😘"
rs[38] = "عسل يعمري 😌🍃"

ws[39] = "😋"
rs[39] = "جوعان🙁"

ws[40] = "😋😋"
rs[40] = "جوعان 🤔لو مريض نفسي😹💔"

ws[41] = "😎"
rs[41] = "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"

ws[42] = "😎😎"
rs[42] = "مسوي عمليه لعيونك 😔 لو انت خبل🙌😿"

ws[43] = "😏"
rs[43] = "عود شوفوني اني شخصـية 😣وهو وجـهه ماله غراض😘🍃"

ws[44] = "😏😏"
rs[44] = "شبي حلگك اعوج 😏 "

ws[45] = "😒😒"
rs[45] = "شبيك 🙄 ليش ضايج 😳💔"

ws[46] = "😒"
rs[46] = "يمـه زعلان الحلو 🙈 مايگلي مرحبا😘🍃"

ws[47] = "😔"
rs[47] = "ليش زعلان يعمري 😔 تعال احجيلي اهمومك💔🍃"

ws[48] = "😔😔"
rs[48] = "منو مضوجك🙀 دليني عليه😾💪🏼"

ws[49] = "😡😡"
rs[49] = "عود ضاج تهي بهي😂💔"

ws[50] = "😳"
rs[50] = "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃"

ws[51] = "😳😳"
rs[51] = "شبيك 🙀 مصدوم شنو 🙄 جديده عليك حتى تنصدم ♥️🍃"

ws[52] = "😭😭"
rs[52] = "منو وياك اليوم اگطعه😈👊"

ws[53] = "😭"
rs[53] = "لتبجـي متسوى 😳🍃"

ws[54] = "🤔"
rs[54] = "على كيفك يترامب😹🍃"

ws[55] = "🤔🤔"
rs[55] = "الحمد لله 😔 راح تنلاص المشكله😿 بالزايد كام يفكر😂🍃"

ws[56] = "😻😻"
rs[56] = "صعد الحب 😽"

ws[57] = "😹😹😹"
rs[57] = "دوم الضحكه يالغالي 😻"

ws[58] = "بوت"
rs[58] = "عـود لوتـي 🙀 يگـول بوت عبالـه طافـي💔 ويـضل يمسلت وينشر روابط 😳🍃"

ws[59] = "البوت"
rs[59] = "شبي معاجبك 😒🍃"

ws[60] = "تحبني"
rs[60] = "مو بس احبك 😌 اموت بيك حياتي😻🍃"

ws[61] = "شكد"
rs[61] = "بكد هوى الله 😳💔"

ws[62] = "فديتك"
rs[62] = "فداك العاداك حبيبي😘"

ws[63] = "فدوه"
rs[63] = "من جنت بصف الاول اني قدووه🙄😹🍃"

ws[64] = "غني"
rs[64] = "انا وياج يم شامه🙈عدكم سطح عدنه سطح ومسافر اني مالصبح😔انا وياج يم شامه😳عدكم درج عدنا درج وريوگ مامتغدي انا وياج يم شامه🤔 ياجماعه والله سالفه تضحچ😂😂🍃"

ws[65] = "غنيلي"
rs[65] = "شتحب تسمع 🙈 (حاتم العراقي- ماجد المهندس- حمزيه العوره- كاظم الساهر) انت وذوقك😻🍃"

ws[66] = "حاتم العراقي"
rs[66] = "لا بربك☹️ هو هذا هم مطرب حتى احفظله 😹💔🍃"

ws[67] = "ماجد المهندس"
rs[67] = "شبيك عيني هذا شغله بالهندسه والتخريب 😳 شجابه ع الغنه😌😂🍃"

ws[68] = "حمزيه العوره"
rs[68] = "لـك هاي ام السحوره 😳 ختولي ما حافظله☹️😹"

ws[69] = "كاظم الساهر"
rs[69] = "هو منيله نغمات 😒غير هاي ( قولي احبـك كي تزيدي وسامتي ) بس هاي لاطش عليه 🙄😹🍃"

ws[70] = "تخليني"
rs[70] = "اٌيــــُـــــي حبيْ اخُــــليكْ عْـــِلوااا 😔 اليْوم تعْبــانْ انيَ ٌهـٰٰـٰـٰـــاكْ 🐑🐏🐑🐄🐄 اسُْــــرح بيهنْ بــسٰ ديــرْ بالكْ عليِـــ💋ــهن فدِوه موْ تصْير اْثولَ 🙊وتيــهْم😻😹😹☝️"

ws[71] = "غازلني"
rs[71] = "راح اُحـــط شِفتـِــي 💋 علـٌِ شفتٌِــك 💋 وشُُـــبَع ْ من الـ شفِـفهٌ  ضُوگ😋 راحُ اجرٰبيه عٰ لـ كيفّـي 🙀 والا  اخلــي الُجوُه فوٰگ 😹😻☝️"

ws[72] = "بوسني"
rs[72] = "مْـواحْ💋 نسخْ لصقْ ع الشفهٌْ 🙈"

ws[73] = "بوسه جبيره"
rs[73] = "خٌِـــايب گـم 😂 يريد بوسهْ وجه القرْد🐵😹😹🙌"

ws[74] = "كوكي"
rs[74] = "هذْا مطوري  فديتْ ربهْ😌☝️"

ws[75] = "همسه"
rs[75] = "••• اوُٓيٌــلــيْ لكُٰ هاُي تٰٰــــاُجْ 👑 وعِــلٰم شُحٰــدهٰ الــيندٰگ بيٰهه•••😍😻☝️"

ws[76] = "ساره"
rs[76] = "اوٌيليْ لك ٌ ضحٌكتهٌ تسوْه الدنٌيا وٌما ُبيههّ😻☝️"

ws[77] = "فطم"
rs[77] = "(صٌِـــوتهٌ، صفٌاتهٌ، ضِّـــحكتّهُّ...احلْى شيٌ بالدٌنياْ)🙈😻☝️"

ws[78] = "فقار"
rs[78] = "هذٌا ضْلـــع كُِوٌكــٰــي فدٍيتْه😻☝️"

ws[79] = "كرار"
rs[79] = "عــمي هذا الذُيــب 🙀 منو يلحــگه😻🍃"

ws[80] = "علوش"
rs[80] = "هذا ظلعــي فديــت اسـمه🙈😻"

ws[81] = "غيث"
rs[81] = "ضلعــي فديت ربـه😘🍃"

ws[82] = "اتفل"
rs[82] = "خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خہــ💦ــخــ💦ـــــہٰٰخ تٌـٌـٌـٌ﴿💦﴾ـٌـٌـٌـٌف✟خــ😚ــخــ😚ـخ تــ💦ــفــ💦ــوو خخخخــووــووــووــوو💦💨😚تفــووــو😹😹"

ws[83] = "سحك"
rs[83] = "اويلي 😔 لك اذا مرام وساره وحوراء هنا اعتبر نفسـك☹️ انفظــحت بـ٩٩  كروب الحل الوحيـد والاخيـر 😳 غادر الكـروب احسـلك 😂💔🍃"

ws[84] = "عسل"
rs[84] = "فدوه هاي ادمونــة الكروب فديـته😘🙈"

ws[85] = "حوراء"
rs[85] = "اويلي 🙈 صاكــةالكـروب 😻 اروحــله فدووه♥️🎈"

ws[86] = "مريم"
rs[86] = "هاي شمعـة الكروب 🙀 بدونـه الكروب مضلم😻🍃"

ws[87] = "اريد بوت"
rs[87] = "تعال هنا @MAITHAMO_Obot"

ws[88] = "اريد قناه"
rs[88] = "تعال هنا @WAHUM_2 💋"

ws[89] = "قناه"
rs[89] = "@WAHUM_2 💋"

ws[90] = "اريد قناة"
rs[90] = "@WAHUM_2"

ws[91] = "هذا ياسورس"
rs[91] = " تريد بوت تعال هنا @MAITHAMO_Obot ♥️🎈"

ws[92] = "بوت"
rs[92] = "عـود لوتي 🙀 يگول بوت عباله طافي💔 ويضل يمسلت وينشر روابط 😳🍃"
-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
